{
  "0": {
    "Range": "0-10%",
    "Headline_full": "onlyyyy yooooou~~~your friend thinks of you EXACTLY THE SAME as you do!",
    "Headline_short": "0% delusion - your friend agrees on your mbti type!",
    "Copywriting": [
      "Look at you, practically a psychic twin of your friend's perception! It's eerie, like you've got mind-reading powers or you're just really predictable. While it's cute that you're on the same wavelength, maybe it's time to throw a curveball just to keep things interesting. Being understood is great and all, but a little mystery never hurt anyone."
    ]
  },
  "20": {
    "Range": "20-30%",
    "Headline_full": "you know yourself so well that if you went to a parallel dimension you’d still recognize yourself",
    "Headline_short": "VERY slight delusion - your friend basically agrees on your mbti",
    "Copywriting": [
      "So, you're kinda understood, kinda not—like a book your friend skimmed through while binge-watching TV. They caught the main plot but missed all the juicy details. It's time to remind them that you're more than just background noise. Maybe toss in a few plot twists to keep them on their toes. Show them there's more to you than the Cliff Notes version."
    ]
  },
  "30": {
    "Range": "30-40%",
    "Headline_full": "you’re so consistently you that people would dm you just to say “this is so you”",
    "Headline_short": "your mbti is basically approved by your friend with some minor differences",
    "Copywriting": [
      "Ah, the middle of the road—exciting as lukewarm coffee. Your friend thinks they've got you figured out, but they're only scratching the surface. You're like a mystery novel they've only read half of, making wild guesses about the ending. Maybe it's time to reveal a few secrets or keep them guessing. After all, who doesn't love a good cliffhanger?"
    ]
  },
  "40": {
    "Range": "40-60%",
    "Headline_full": "sometimes you’re this, sometimes you’re that - you’re hard to read!",
    "Headline_short": "half half - your friend doesn’t fully agree",
    "Copywriting": [
      "Perfectly balanced, as if you're both playing a game of 'who knows who better' and calling it a draw. But let's be honest, it's like agreeing to disagree on who you really are. One day you're on the same page, the next day you're not even in the same book. Maybe it's time to mix up the storyline a bit—keep them engaged, or just enjoy the equilibrium."
    ]
  },
  "60": {
    "Range": "60-80%",
    "Headline_full": "you can be barbie if you want but maybe you’re not",
    "Headline_short": "you’re a bit delusional....",
    "Copywriting": [
      "Welcome to the realm of the misunderstood, or should we say, misinterpreted. It's as if your friend is watching a movie about you, but the subtitles don't match the dialogue. They think they're getting the gist, but the plot's lost in translation. Maybe it's time for a reality check, or just let them think you're the international film of mystery you apparently are. Either way, it's clear you're playing the lead role in a story that's still unfolding."
    ]
  },
  "80": {
    "Range": "80-90%",
    "Headline_full": "hmm the delusion is as strong as a nugu cat thinking they’re lion king",
    "Headline_short": "DELULU ALERT!!! maybe you act differently in context",
    "Copywriting": [
      "Have you ever felt unsure about who you really are or what you’re actually like? If this is not the first friend who’s given you a relatively different take on your MBTI, then maybe it’s time to do some soul searching.",
      "You might be quite delusional about what you think you are compared to what your friend thinks you are. It can help to try to catch yourself when you’re in different situations to observe if you actually behave the way you think.",
      "That said, people are often not particularly one way or the other. We may also change as people. So don’t worry too much!",
      "If you’re not sure where to start, try going on the Journeys! People tend to find identifying their preferences is easier to do."
    ]
  },
  "90": {
    "Range": "90-100%",
    "Headline_full": "if delulu was a person, that’s you",
    "Headline_short": "delusion champion - who are you really?!",
    "Copywriting": [
      "It seems your friend thinks you're a different species!",
      "100% delusional huh? That's like saying a cat and a kangaroo are almost the same because they both have four legs. It's like your friend looked at you, squinted, tilted their head, and really see a side of you that seems opposite to how you see yourself. And you're just sitting there, wondering if you've been living in a parallel universe all this time.",
      "Maybe it's time for some introspection. If your friend's perception of you is so different from your own, perhaps you've been a bit delusional about your personality. Or maybe you're just a complex, multi-faceted individual that can't be boxed into a four-letter MBTI type. Either way, it's all in good fun.",
      "It’d be interesting to see how your other friends view you as well!"
    ]
  }
}
